In [1]:
import pandas as pd

In [2]:
from src.components.data_import.load_data import DATA_PATH
from src.components.schemas.table_schemas import Tables

In [3]:
for data in Tables:
    print(data.name, data.value)

DOMESTIC_CONSUMPTION coffee_domestic_consumption
EXPORT coffee_export
INVENTORY coffee_green_coffee_inventorie
IMPORT coffee_import
IMPORTERS_CONSUMPTION coffee_importers_consumption
PRODUCTION coffee_production
RE_EXPORT coffee_re_export

In [4]:
coffee_domestic_consumption_df = pd.read_parquet(
    DATA_PATH.joinpath(Tables.DOMESTIC_CONSUMPTION.value + ".pq")
)
coffee_domestic_consumption_df.head(2)

,Country,Coffee type,1990/91,1991/92,1992/93,1993/94,1994/95,1995/96,1996/97,1997/98,...,2011/12,2012/13,2013/14,2014/15,2015/16,2016/17,2017/18,2018/19,2019/20,Total_domestic_consumption
0,Angola,Robusta/Arabica,1200000,1800000,2100000,1200000,1500000,600000,1200000,2400000,...,1800000,1800000,1800000,1800000,1800000,1800000,1800000,1800000,1800000,46500000
1,Bolivia (Plurinational State of),Arabica,1500000,1620000,1650000,1710000,1770000,1830000,1890000,1950000,...,2940000,3030000,3120000,3210000,3300000,3420000,3510000,3600000,3660000,75180000

In [5]:
coffee_export_df = pd.read_parquet(
    DATA_PATH.joinpath(Tables.EXPORT.value + ".pq")
)
coffee_export_df.head(2)

,Country,1990,1991,1992,1993,1994,1995,1996,1997,1998,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,Total_export
0,Angola,5040000,4260000,4800000,2340000,480000,2460000,3120000,3000000,3240000,...,480000,480000,360000,540000,660000,660000,540000,540000,1380000,43320000
1,Bolivia (Plurinational State of),9360000,4440000,5760000,2820000,5040000,5640000,7380000,6660000,5820000,...,4440000,3780000,3300000,3720000,1800000,1320000,1560000,1320000,1200000,137460000

In [6]:
inventorie_df = pd.read_parquet(
    DATA_PATH.joinpath(Tables.INVENTORY.value + ".pq")
)
inventorie_df.head(2)

,Country,1990,1991,1992,1993,1994,1995,1996,1997,1998,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,Total_inventorie
0,Austria,19980000,19980000,22020000,19980000,16980000,16440000,14760000,13860000,12600000,...,6660000,5820000,5520000,5760000,5760000,5400000,4800000,4800000,4800000,306660000
1,Cyprus,600000,720000,600000,480000,780000,780000,720000,360000,540000,...,360000,240000,420000,720000,360000,120000,180000,300000,0,14520000

In [7]:
coffee_import_df = pd.read_parquet(
    DATA_PATH.joinpath(Tables.IMPORT.value + ".pq")
)
coffee_import_df.head(2)

,Country,1990,1991,1992,1993,1994,1995,1996,1997,1998,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,Total_import
0,Austria,112800000,123480000,132360000,110160000,85020000,73860000,72600000,77640000,77580000,...,87120000,93540000,93300000,91500000,90780000,89700000,87600000,85740000,86880000,2765760000
1,Belgium,0,0,0,0,0,0,0,0,0,...,349680000,340080000,330120000,312720000,332040000,363120000,340620000,344520000,371940000,6240540000

In [8]:
coffee_importers_consumption_df = pd.read_parquet(
    DATA_PATH.joinpath(Tables.IMPORTERS_CONSUMPTION.value + ".pq")
)
coffee_importers_consumption_df.head(2)

,Country,1990,1991,1992,1993,1994,1995,1996,1997,1998,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,Total_import_consumption
0,Austria,80400000,78120000,72720000,80100000,65160000,60720000,64560000,65220000,66300000,...,67020000,76140000,74940000,68100000,68160000,71580000,69720000,70320000,70380000,1904520000
1,Belgium,0,0,0,0,0,0,0,0,0,...,56040000,54900000,74700000,75540000,64440000,90120000,78000000,81900000,71100000,1460520000

In [9]:
coffee_production_df = pd.read_parquet(
    DATA_PATH.joinpath(Tables.PRODUCTION.value + ".pq")
)
coffee_production_df.head(2)

,Country,Coffee type,1990/91,1991/92,1992/93,1993/94,1994/95,1995/96,1996/97,1997/98,...,2011/12,2012/13,2013/14,2014/15,2015/16,2016/17,2017/18,2018/19,2019/20,Total_production
0,Angola,Robusta/Arabica,3000000.0,4740000.0,4680000.0,1980000.0,4620000.0,3720000.0,4260000.0,3840000.0,...,1740000.0,1980000.0,2100000.0,2340000.0,2460000.0,2700000.0,2100000.0,2520000.0,3120000.0,82080000.0
1,Bolivia (Plurinational State of),Arabica,7380000.0,6240000.0,7200000.0,3060000.0,7020000.0,8520000.0,7500000.0,8460000.0,...,7920000.0,6300000.0,7200000.0,6000000.0,5040000.0,4680000.0,5040000.0,4980000.0,4860000.0,207000000.0

In [10]:
coffee_re_export_df = pd.read_parquet(
    DATA_PATH.joinpath(Tables.RE_EXPORT.value + ".pq")
)
coffee_re_export_df.head(2)

,Country,1990,1991,1992,1993,1994,1995,1996,1997,1998,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,Total_re_export
0,Austria,24900000,45360000,57600000,32100000,22860000,13740000,9780000,13320000,12600000,...,21900000,18240000,18660000,23160000,22680000,18480000,18480000,15420000,16440000,869220000
1,Belgium,0,0,0,0,0,0,0,0,0,...,293640000,285240000,255420000,237180000,267600000,273000000,262620000,262620000,300840000,4779780000